{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input0"}, "inbound_nodes": []}, {"name": "depth_conv1", "class_name": "DepthwiseConv2D", "config": {"name": "depth_conv1", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 22, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "depthwise_constraint": null}, "inbound_nodes": [[["input0", 0, 0, {}]]]}, {"name": "relu2", "class_name": "Activation", "config": {"name": "relu2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["depth_conv1", 0, 0, {}]]]}, {"name": "depth_conv3", "class_name": "SeparableConv2D", "config": {"name": "depth_conv3", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu2", 0, 0, {}]]]}, {"name": "bn4", "class_name": "BatchNormalization", "config": {"name": "bn4", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv3", 0, 0, {}]]]}, {"name": "relu5", "class_name": "Activation", "config": {"name": "relu5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4", 0, 0, {}]]]}, {"name": "depth_conv6", "class_name": "SeparableConv2D", "config": {"name": "depth_conv6", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu5", 0, 0, {}]]]}, {"name": "bn7", "class_name": "BatchNormalization", "config": {"name": "bn7", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv6", 0, 0, {}]]]}, {"name": "relu8", "class_name": "Activation", "config": {"name": "relu8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn7", 0, 0, {}]]]}, {"name": "depth_conv9", "class_name": "SeparableConv2D", "config": {"name": "depth_conv9", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu8", 0, 0, {}]]]}, {"name": "bn10", "class_name": "BatchNormalization", "config": {"name": "bn10", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv9", 0, 0, {}]]]}, {"name": "relu11", "class_name": "Activation", "config": {"name": "relu11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn10", 0, 0, {}]]]}, {"name": "depth_conv12", "class_name": "SeparableConv2D", "config": {"name": "depth_conv12", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu11", 0, 0, {}]]]}, {"name": "bn13", "class_name": "BatchNormalization", "config": {"name": "bn13", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv12", 0, 0, {}]]]}, {"name": "relu14", "class_name": "Activation", "config": {"name": "relu14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn13", 0, 0, {}]]]}, {"name": "depth_conv15", "class_name": "SeparableConv2D", "config": {"name": "depth_conv15", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu14", 0, 0, {}]]]}, {"name": "bn16", "class_name": "BatchNormalization", "config": {"name": "bn16", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv15", 0, 0, {}]]]}, {"name": "relu17", "class_name": "Activation", "config": {"name": "relu17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn16", 0, 0, {}]]]}, {"name": "depth_conv18", "class_name": "SeparableConv2D", "config": {"name": "depth_conv18", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu17", 0, 0, {}]]]}, {"name": "bn19", "class_name": "BatchNormalization", "config": {"name": "bn19", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv18", 0, 0, {}]]]}, {"name": "relu20", "class_name": "Activation", "config": {"name": "relu20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn19", 0, 0, {}]]]}, {"name": "depth_conv21", "class_name": "SeparableConv2D", "config": {"name": "depth_conv21", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu20", 0, 0, {}]]]}, {"name": "bn22", "class_name": "BatchNormalization", "config": {"name": "bn22", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv21", 0, 0, {}]]]}, {"name": "relu23", "class_name": "Activation", "config": {"name": "relu23", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn22", 0, 0, {}]]]}, {"name": "depth_conv24", "class_name": "SeparableConv2D", "config": {"name": "depth_conv24", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu23", 0, 0, {}]]]}, {"name": "bn25", "class_name": "BatchNormalization", "config": {"name": "bn25", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv24", 0, 0, {}]]]}, {"name": "relu26", "class_name": "Activation", "config": {"name": "relu26", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn25", 0, 0, {}]]]}, {"name": "depth_conv27", "class_name": "SeparableConv2D", "config": {"name": "depth_conv27", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu26", 0, 0, {}]]]}, {"name": "bn28", "class_name": "BatchNormalization", "config": {"name": "bn28", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv27", 0, 0, {}]]]}, {"name": "relu29", "class_name": "Activation", "config": {"name": "relu29", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn28", 0, 0, {}]]]}, {"name": "depth_conv30", "class_name": "SeparableConv2D", "config": {"name": "depth_conv30", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu29", 0, 0, {}]]]}, {"name": "bn31", "class_name": "BatchNormalization", "config": {"name": "bn31", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv30", 0, 0, {}]]]}, {"name": "relu32", "class_name": "Activation", "config": {"name": "relu32", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn31", 0, 0, {}]]]}, {"name": "depth_conv33", "class_name": "SeparableConv2D", "config": {"name": "depth_conv33", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu32", 0, 0, {}]]]}, {"name": "bn34", "class_name": "BatchNormalization", "config": {"name": "bn34", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv33", 0, 0, {}]]]}, {"name": "relu35", "class_name": "Activation", "config": {"name": "relu35", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn34", 0, 0, {}]]]}, {"name": "depth_conv36", "class_name": "SeparableConv2D", "config": {"name": "depth_conv36", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu35", 0, 0, {}]]]}, {"name": "bn37", "class_name": "BatchNormalization", "config": {"name": "bn37", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv36", 0, 0, {}]]]}, {"name": "relu38", "class_name": "Activation", "config": {"name": "relu38", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn37", 0, 0, {}]]]}, {"name": "depth_conv39", "class_name": "SeparableConv2D", "config": {"name": "depth_conv39", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu38", 0, 0, {}]]]}, {"name": "bn40", "class_name": "BatchNormalization", "config": {"name": "bn40", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv39", 0, 0, {}]]]}, {"name": "relu41", "class_name": "Activation", "config": {"name": "relu41", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn40", 0, 0, {}]]]}, {"name": "depth_conv42", "class_name": "SeparableConv2D", "config": {"name": "depth_conv42", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu41", 0, 0, {}]]]}, {"name": "bn43", "class_name": "BatchNormalization", "config": {"name": "bn43", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv42", 0, 0, {}]]]}, {"name": "relu44", "class_name": "Activation", "config": {"name": "relu44", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn43", 0, 0, {}]]]}, {"name": "depth_conv45", "class_name": "SeparableConv2D", "config": {"name": "depth_conv45", "trainable": true, "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu44", 0, 0, {}]]]}, {"name": "bn46", "class_name": "BatchNormalization", "config": {"name": "bn46", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["depth_conv45", 0, 0, {}]]]}, {"name": "relu47", "class_name": "Activation", "config": {"name": "relu47", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn46", 0, 0, {}]]]}, {"name": "conv48", "class_name": "SeparableConv2D", "config": {"name": "conv48", "trainable": true, "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "pointwise_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "pointwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["relu47", 0, 0, {}]]]}], "input_layers": [["input0", 0, 0]], "output_layers": [["conv48", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}